#!/usr/bin/env bash

#-------------------------------------------------
#脚本功能:创建定时任务收集测试结果
#摘要:创建定时任务，将远程服务器10.2.5.25上的
#     测试结果目录[~/autotest_result]
#     同步到本地/AutoTest目录下
#     每隔2分钟,同步一次测试结果文件到本地服务器
#-------------------------------------------------

#-------------------------------
#功能调用脚本
#./Operation_CronTab.sh
#-------------------------------

#if [ $# -ne 2 ];then
# echo "usage: $0 TestType Platform" 
# exit 1
#fi

#-------------------------------------------------

#添加定时任务
sh Operation_CronTab.sh  add
