#!/bin/bash

#-----------------------------------------------------------
#脚本功能:收集测试结果，最终形成html表格在前端展示
#-----------------------------------------------------------

#-----------------------------------------------------------

start_time=`date +%s`              #定义脚本运行的开始时间

#-----------------------------------------------------------
#初始化测试结果收集环境
#包括初始化配置一些目标目录
#用于存放不同测试类型及不同测试平台的目录等
echo "***************************************************"
echo "Begin to Init Test Env..."
pushd Init_Env
sh init_TestEnv.sh
popd
echo "Init Test Env End."

#创建测试结果分类目录的架构目录
#包括PC,Server,KVM

stop_time=`date +%s`  #定义脚本运行的结束时间

echo "***************************************************"
echo "Exec Time:`expr $stop_time - $start_time`s"
echo "***************************************************"
