#!/bin/bash

#------------------------------------------------------------------------
#初始化测试环境
#1.放置所有测试节点ip分组详细信息
#2.放置所有测试用例分组配置文件
#3.放置所有测试用例对应关系文件
#4.放置所有测试用例对应中文文件
#5.放置所有测试用例存储文件
#6.创建测试结果Excel文件的存储目录
#7.搭建python虚拟环境
#8.安装必要软件
#9.复制必要文件
#10.初始化新的分类目录
#11.初始化数据表
#------------------------------------------------------------------------


#------------------------------------------------------------------------
#1.放置所有测试节点ip分组详细信息
#------------------------------------------------------------------------
#文件名:ip_list.ini
#复制文件到:/data/测试类型/测试平台/ip_list.ini
#------------------------------------------------------------------------
sh init_IPListFile.sh


#------------------------------------------------------------------------
#2.放置所有测试用例分组配置文件
#文件名:TestcaseGroup_测试类型.ini
#例如:
#TestcaseGroup_OS.ini
#TestcaseGroup_Kernel.ini
#TestcaseGroup_KVM.ini
#复制文件到:/data/测试类型/TestcaseGroup_测试类型.ini
#------------------------------------------------------------------------
sh init_TestGroupFile.sh

#------------------------------------------------------------------------
#3.放置所有测试用例对应关系文件
#文件名:TestCaseRelation.file
#例如:
#复制文件到:/data/测试类型/TestCaseRelation.file
#------------------------------------------------------------------------
sh init_TestCaseRelation.sh

#------------------------------------------------------------------------
#4.放置所有测试用例对应标记文件
#  标记为1则需要设置测试开始时间，否则不需要，此功能可能会有扩展
#文件名:TestCaseType.txt
#例如:
#复制文件到:/data/TestCaseType.txt
#------------------------------------------------------------------------
sh init_TestCaseType.sh

#------------------------------------------------------------------------
#4.放置所有测试用例对应中文文件
#文件名:TestCaseRef.txt
#------------------------------------------------------------------------
sh init_TestCaseRef.sh

#------------------------------------------------------------------------
#5.放置所有测试用例存储文件
#文件名:TestResults.ini
#复制文件到:/data/测试类型/测试平台/TestResults.ini
#------------------------------------------------------------------------
sh init_TestResultsFile_All.sh

#------------------------------------------------------------------------
#6.创建测试结果Excel文件的存储目录(多个Excel合并目录以及最终结果目录)
#合并目录:/data/测试类型/测试平台/merge-Excel
#最终目录:/data/测试类型/测试平台/Results-Excel
#------------------------------------------------------------------------
sh init_Excel_Dirs_All.sh

#------------------------------------------------------------------------
#7.搭建python虚拟环境（避免对本机python环境造成破坏）
#------------------------------------------------------------------------
sh init_work_env_wrapper.sh

#------------------------------------------------------------------------
#8.安装必要软件
#------------------------------------------------------------------------
sh init_pkg_required.sh

#------------------------------------------------------------------------
#9.复制必要文件
#------------------------------------------------------------------------
sh init_required_files.sh

#------------------------------------------------------------------------
#10.初始化新的分类目录
#------------------------------------------------------------------------
sh init_Classify.sh

#------------------------------------------------------------------------
#11.初始化数据表
#------------------------------------------------------------------------
sh Init_DB_Tables.sh


echo "-------------------------------------------"
echo "OK,Now the test environment is finished."
echo "-------------------------------------------"
